app/controllers/authentications_controller.rb

SELECT "authentications".* FROM "authentications" WHERE ("authentications".user_id = 1) AND ("authentications"."uid" = '15179093') AND ("authentications"."provider" = 'twitter') LIMIT 1
INSERT INTO "authentications" ("updated_at", "user_id", "uid", "created_at", "provider") VALUES ('2011-01-25 21:47:00.949965', 1, 'https://www.google.com/accounts/o8/id?id=AItOawmqniuwkfC9Kzr8IN_9FtDLVvqA-n-AcxQ', '2011-01-25 21:47:00.949965', 'google_apps')
INSERT INTO "users" ("current_sign_in_ip", "password_salt", "encrypted_password", "user_name", "sign_in_count", "reset_password_token", "last_sign_in_at", "last_sign_in_ip", "created_at", "updated_at", "remember_created_at", "current_sign_in_at", "remember_token", "email") VALUES (NULL, '', '', 'phaenotyp', 0, NULL, NULL, NULL, '2011-01-25 22:17:19.270638', '2011-01-25 22:17:19.270638', NULL, NULL, NULL, 'phaenotyp@googlemail.com')
---
  def create
    #render :text => request.env['omniauth.auth'].to_json
    omniauth = request.env["omniauth.auth"]
    authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])
    if authentication
      flash[:notice] = "Signed in successfully."
      sign_in_and_redirect(:user, authentication.user)
    elsif current_user
      current_user.authentications.create!(:provider => omniauth['provider'], :uid => omniauth['uid'])

SELECT "authentications".* FROM "authentications" WHERE ("authentications".user_id = 1) AND ("authentications"."id" = 2) LIMIT 1
DELETE FROM "authentications" WHERE ("authentications"."id" = 2)
---
  def destroy
    @authentication = current_user.authentications.find(params[:id])
    @authentication.destroy