app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "updated_at", "user_id") VALUES ('Abitur nicht dabei', '2011-01-16 00:41:16.792357', '2011-01-16 00:41:16.792357', NULL)
---
  def create
    @comment.user = current_user
    if @comment.save

UPDATE "comments" SET "updated_at" = '2011-01-16 01:24:13.411705', "body" = 'Schinkenröllchen + Ruccola' WHERE ("comments"."id" = 4)
---
  def update

    if @comment.update_attributes(params[:comment])

DELETE FROM "comments" WHERE ("comments"."id" = 1)
---
  def destroy

    @comment.destroy